## Question 1: **Answer**

In [1]:
import pandas as pd
import sqlite3

In [ ]:
def add_data_to_database(input_data):
    try:
        data = pd.read_csv(input_data)
        engine = sqlite3.connect('zoo_animals.db')
        data.to_sql('animals', con=engine, index = False)
        engine.close()
    except Exception as e:
        print(f"Error: {e}")

data = "/content/zoo_animals.csv"
add_data_to_database(data)

In [3]:
%load_ext sql

In [4]:
# Connecting to the database
%sql sqlite:///zoo_animals.db

In [5]:
# Default to duplicated style
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [6]:
%%sql
SELECT * FROM animals LIMIT 5;

 * sqlite:///zoo_animals.db
Done.

[(1, 'Fiona', 'Hippopotamus', 'Female', 10, 3200, 56, 12, 'Herbivore', 'African Savanna', '2012-05-24', 'Rescue', 'Nile River', 'Endangered'),
 (2, 'Leo', 'Lion', 'Male', 12, 420, 60, 84, 'Carnivore', 'African Savanna', '2015-06-01', 'Donation', 'Kruger National Park', 'Vulnerable'),
 (3, 'Maya', 'Jaguar', 'Female', 8, 200, 60, 72, 'Carnivore', 'Central American Rainforest', '2018-04-15', 'Captive Breeding', 'Belize Zoo', 'Least Concern'),
 (4, 'Nala', 'Giraffe', 'Female', 14, 2400, 14, 18, 'Herbivore', 'African Savanna', '2010-03-12', 'Wild Capture', 'Masai Mara National Reserve', 'Not Threatened'),
 (5, 'Oscar', 'Orangutan', 'Male', 15, 280, 60, 96, 'Omnivore', 'Bornean Rainforest', '2009-11-07', 'Rescue', 'Sumatran Orangutan Rehabilitation Center', 'Critically Endangered')]

## Question 2: **Answer**

In [7]:
%%sql
SELECT
    animal_name,
    species,
    weight
FROM animals
WHERE weight BETWEEN 500 AND 1000
ORDER BY species DESC;

 * sqlite:///zoo_animals.db
Done.

[('Zoe', 'Zebra', 700),
 ('Tristan', 'Tiger', 500),
 ('Penny', 'Polar Bear', 600)]

## Question 3: **Answer**

In [8]:
%%sql
SELECT
    species,
    acquisition_method
FROM animals
WHERE acquisition_method IN ('Rescue','Wild Capture');

 * sqlite:///zoo_animals.db
Done.

[('Hippopotamus', 'Rescue'),
 ('Giraffe', 'Wild Capture'),
 ('Orangutan', 'Rescue'),
 ('Polar Bear', 'Rescue'),
 ('Sea Lion', 'Rescue'),
 ('Wallaby', 'Rescue'),
 ('Zebra', 'Wild Capture')]

## Question 4: **Answer**

In [9]:
%%sql
SELECT
    gender,
    COUNT(*) AS number_of_males,
    COUNT(*) * 100.0 / (SELECT COUNT(*) FROM animals) AS percentage
FROM animals
WHERE gender = 'Male'
GROUP BY gender;

 * sqlite:///zoo_animals.db
Done.

[('Male', 7, 43.75)]

## Question 5: **Answer**

In [10]:
%%sql
SELECT
    AVG(age) AS Avg_age_lions_Sea_lions
FROM animals
WHERE species IN ('Lion', 'Sea Lion');

 * sqlite:///zoo_animals.db
Done.

[(10.5,)]

## Question 6: **Answer**

In [11]:
%%sql
SELECT
    animal_name,
    Species,
    acquisition_date
FROM animals
WHERE acquisition_date
    BETWEEN '2015-01-01' AND '2020-12-31'
    AND diet = "Carnivore"
ORDER BY acquisition_date DESC;

 * sqlite:///zoo_animals.db
Done.

[('Maya', 'Jaguar', '2018-04-15'),
 ('Penny', 'Polar Bear', '2016-08-23'),
 ('Leo', 'Lion', '2015-06-01')]

In [12]:
# %%sql
# DROP TABLE animals